# MemberForces Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MemberForces Properties
MemberForces Class See Also
---
The MemberForces type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Force | The translational forces at relative point position of the element. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Moment | The rotational forces at relative point position of the element. |
| Start | Member Forces position on analytical element. True for start, false for end. |

# See Also
MemberForces Class
Autodesk.Revit.DB.Structure Namespace